/**
 * 日期选择框
 * @type year 年份
 * @type month 月份
 * @type day 日数
 */
var year = document.getElementById("YYYY");
var month = document.getElementById("MM");
var day = document.getElementById("DD");
/**
 * 每月天数
 * 不得在程序中用数组直接运算、防止改变数组内容
 * @type 天数数组
 */
var MonDay = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
/** 是否闰年 */
function IsLeapYear(y) {
    return (y % 4 == 0 && (y % 100 != 0 || y % 400 == 0))
}
/**
 * 初始化日期
 * @param {[type]} Y 年
 * @param {[type]} M 月
 * @param {[type]} D 日
 */
function InitDate(Y, M, D) {
    /**
     * 检测日期是否正确
     * @type {Date}
     */
    var Year = new Date().getFullYear();
    if (Y == "" || Y > Year || Y < (Year - 100)) {
        Y = Year;
        M = new Date().getMonth() + 1;
        D = new Date().getDate();
    }
    if (M == "" || M < 1 || M > 12) {
        M = new Date().getMonth() + 1;
        D = new Date().getDate();
    }
    var MaxD = MonDay[M - 1];
    if (M == 2 && IsLeapYear(Y)) {
        MaxD = 29;
    }
    if (D == "" || D < 1 || D > MaxD) {
        D = new Date().getDate();
    }
    //生成年数列表
    for (var i = (Year - 100); i <= Year; i++) {
        year.options.add(new Option(i, i));
    }
    //生成月数列表
    for (var i = 1; i <= 12; i++) {
        //一位时前面补0
        if (i < 10) {
            month.options.add(new Option("0" + i, i));
        } else {
            month.options.add(new Option(i, i));
        }
    }
    //本月天数
    var Day = MonDay[M - 1];
    //闰年二月天数
    if (M == 2 && IsLeapYear(Y)) {
        Day++;
    }
    //生成日数列表
    for (var i = 1; i <= Day; i++) {
        //一位时前面补0
        if (i < 10) {
            day.options.add(new Option("0" + i, i));
        } else {
            day.options.add(new Option(i, i));
        }
    }
    year.value = Y;
    month.value = M;
    day.value = D;
}
/**
 * 年份变化函数
 */
year.onchange = function() {
        var Month = month.options[month.selectedIndex].value;
        /**
         * OldDay 原来的日期
         * 用来还原已经选择的日期
         * @type {[type]}
         */
        var OldDay = day.value;
        //清空天数
        day.options.length = 0;
        //本月天数
        var Day = MonDay[Month - 1];
        //闰年二月天数
        if (Month == 2 && IsLeapYear(this.value)) {
            Day = 29;
        }
        //生成日数列表
        for (var i = 1; i <= Day; i++) {
            //一位时前面补0
            if (i < 10) {
                day.options.add(new Option("0" + i, i));
            } else {
                day.options.add(new Option(i, i));
            }
        }
        //如果存在的话，还原改变之前的日期
        if (day.options.length >= OldDay) {
            day.value = OldDay;
        }
    }
    /**
     * 月数变化函数
     */
month.onchange = function() {
        var Year = year.options[year.selectedIndex].value;
        /**
         * OldDay 原来的日期
         * 用来还原已经选择的日期
         * @type {[type]}
         */
        var OldDay = day.value;
        //清空天数
        day.options.length = 0;
        //本月天数
        var Day = MonDay[this.value - 1];
        //闰年二月天数
        if (this.value == 2 && IsLeapYear(Year)) {
            Day = 29;
        }
        //生成日数列表
        for (var i = 1; i <= Day; i++) {
            //一位时前面补0
            if (i < 10) {
                day.options.add(new Option("0" + i, i));
            } else {
                day.options.add(new Option(i, i));
            }
        }
        //如果存在的话，还原改变之前的日期
        if (day.options.length >= OldDay) {
            day.value = OldDay;
        }
    }
    /**
     * 定义地区信息数据
     * @type Area
     */
var Area = [{
        id: 1,
        name: "直辖市",
        cities: {
            1: "北京市",
            2: "天津市",
            3: "上海市",
            4: "重庆市"
        }
    }, {
        id: 2,
        name: "特别行政区",
        cities: {
            1: "香港",
            2: "澳门"
        }
    }, {
        id: 3,
        name: "河北省",
        cities: {
            1: "石家庄市",
            2: "唐山市",
            3: "秦皇岛市",
            4: "邯郸市",
            5: "邢台市",
            6: "保定市",
            7: "张家口市",
            8: "承德市",
            9: "沧州市",
            10: "廊坊市",
            11: "衡水市"
        }
    }, {
        id: 4,
        name: "山西省",
        cities: {
            1: "太原市",
            2: "大同市",
            3: "阳泉市",
            4: "长治市",
            5: "晋城市",
            6: "朔州市",
            7: "晋中市",
            8: "运城市",
            9: "忻州市",
            10: "临汾市",
            11: "吕梁市"
        }
    }, {
        id: 5,
        name: "内蒙古",
        cities: {
            1: "呼和浩特市",
            2: "包头市",
            3: "乌海市",
            4: "赤峰市",
            5: "通辽市",
            6: "鄂尔多斯市",
            7: "呼伦贝尔市",
            8: "巴彦淖尔市",
            9: "乌兰察布市",
            10: "兴安盟",
            11: "锡林郭勒盟",
            12: "阿拉善盟"
        }
    }, {
        id: 6,
        name: "辽宁省",
        cities: {
            1: "沈阳市",
            2: "大连市",
            3: "鞍山市",
            4: "抚顺市",
            5: "本溪市",
            6: "丹东市",
            7: "锦州市",
            8: "营口市",
            9: "阜新市",
            10: "辽阳市",
            11: "盘锦市",
            12: "铁岭市",
            13: "朝阳市",
            14: "葫芦岛市"
        }
    }, {
        id: 7,
        name: "吉林省",
        cities: {
            1: "长春市",
            2: "吉林市",
            3: "四平市",
            4: "辽源市",
            5: "通化市",
            6: "白山市",
            7: "松原市",
            8: "白城市",
            9: "延边朝鲜族自治州"
        }
    }, {
        id: 8,
        name: "黑龙江省",
        cities: {
            1: "哈尔滨市",
            2: "齐齐哈尔市",
            3: "鸡西市",
            4: "鹤岗市",
            5: "双鸭山市",
            6: "大庆市",
            7: "伊春市",
            8: "佳木斯市",
            9: "七台河市",
            10: "牡丹江市",
            11: "黑河市",
            12: "绥化市",
            13: "大兴安岭地区"
        }
    }, {
        id: 9,
        name: "江苏省",
        cities: {
            1: "南京市",
            2: "无锡市",
            3: "徐州市",
            4: "常州市",
            5: "苏州市",
            6: "南通市",
            7: "连云港市",
            8: "淮安市",
            9: "盐城市",
            10: "扬州市",
            11: "镇江市",
            12: "泰州市",
            13: "宿迁市"
        }
    }, {
        id: 10,
        name: "浙江省",
        cities: {
            1: "杭州市",
            2: "宁波市",
            3: "温州市",
            4: "嘉兴市",
            5: "湖州市",
            6: "绍兴市",
            7: "金华市",
            8: "衢州市",
            9: "舟山市",
            10: "台州市",
            11: "丽水市"
        }
    }, {
        id: 11,
        name: "安徽省",
        cities: {
            1: "合肥市",
            2: "芜湖市",
            3: "蚌埠市",
            4: "淮南市",
            5: "马鞍山市",
            6: "淮北市",
            7: "铜陵市",
            8: "安庆市",
            9: "黄山市",
            10: "滁州市",
            11: "阜阳市",
            12: "宿州市",
            13: "巢湖市",
            14: "六安市",
            15: "亳州市",
            16: "池州市",
            17: "宣城市"
        }
    }, {
        id: 12,
        name: "福建省",
        cities: {
            1: "福州市",
            2: "厦门市",
            3: "莆田市",
            4: "三明市",
            5: "泉州市",
            6: "漳州市",
            7: "南平市",
            8: "龙岩市",
            9: "宁德市"
        }
    }, {
        id: 13,
        name: "江西省",
        cities: {
            1: "南昌市",
            2: "景德镇市",
            3: "萍乡市",
            4: "九江市",
            5: "新余市",
            6: "鹰潭市",
            7: "赣州市",
            8: "吉安市",
            9: "宜春市",
            10: "抚州市",
            11: "上饶市"
        }
    }, {
        id: 14,
        name: "山东省",
        cities: {
            1: "济南市",
            2: "青岛市",
            3: "淄博市",
            4: "枣庄市",
            5: "东营市",
            6: "烟台市",
            7: "潍坊市",
            8: "济宁市",
            9: "泰安市",
            10: "威海市",
            11: "日照市",
            12: "莱芜市",
            13: "临沂市",
            14: "德州市",
            15: "聊城市",
            16: "滨州市",
            17: "菏泽市"
        }
    }, {
        id: 15,
        name: "河南省",
        cities: {
            1: "郑州市",
            2: "开封市",
            3: "洛阳市",
            4: "平顶山市",
            5: "安阳市",
            6: "鹤壁市",
            7: "新乡市",
            8: "焦作市",
            9: "濮阳市",
            10: "许昌市",
            11: "漯河市",
            12: "三门峡市",
            13: "南阳市",
            14: "商丘市",
            15: "信阳市",
            16: "周口市",
            17: "驻马店市",
            18: "济源市"
        }
    }, {
        id: 16,
        name: "湖北省",
        cities: {
            1: "武汉市",
            2: "黄石市",
            3: "十堰市",
            4: "宜昌市",
            5: "襄樊市",
            6: "鄂州市",
            7: "荆门市",
            8: "孝感市",
            9: "荆州市",
            10: "黄冈市",
            11: "咸宁市",
            12: "随州市",
            13: "恩施土家族苗族自治州",
            14: "仙桃市",
            15: "潜江市",
            16: "天门市",
            17: "神农架林区"
        }
    }, {
        id: 17,
        name: "湖南省",
        cities: {
            1: "长沙市",
            2: "株洲市",
            3: "湘潭市",
            4: "衡阳市",
            5: "邵阳市",
            6: "岳阳市",
            7: "常德市",
            8: "张家界市",
            9: "益阳市",
            10: "郴州市",
            11: "永州市",
            12: "怀化市",
            13: "娄底市",
            14: "湘西土家族苗族自治州"
        }
    }, {
        id: 18,
        name: "广东省",
        cities: {
            1: "广州市",
            2: "韶关市",
            3: "深圳市",
            4: "珠海市",
            5: "汕头市",
            6: "佛山市",
            7: "江门市",
            8: "湛江市",
            9: "茂名市",
            10: "肇庆市",
            11: "惠州市",
            12: "梅州市",
            13: "汕尾市",
            14: "河源市",
            15: "阳江市",
            16: "清远市",
            17: "东莞市",
            18: "中山市",
            19: "潮州市",
            20: "揭阳市",
            21: "云浮市"
        }
    }, {
        id: 19,
        name: "广西",
        cities: {
            1: "南宁市",
            2: "柳州市",
            3: "桂林市",
            4: "梧州市",
            5: "北海市",
            6: "防城港市",
            7: "钦州市",
            8: "贵港市",
            9: "玉林市",
            10: "百色市",
            11: "贺州市",
            12: "河池市",
            13: "来宾市",
            14: "崇左市"
        }
    }, {
        id: 20,
        name: "海南省",
        cities: {
            1: "海口市",
            2: "三亚市",
            3: "五指山市",
            4: "琼海市",
            5: "儋州市",
            6: "文昌市",
            7: "万宁市",
            8: "东方市",
            9: "定安县",
            10: "屯昌县",
            11: "澄迈县",
            12: "临高县",
            13: "白沙黎族自治县",
            14: "昌江黎族自治县",
            15: "乐东黎族自治县",
            16: "陵水黎族自治县",
            17: "保亭黎族苗族自治县",
            18: "琼中黎族苗族自治县"
        }
    }, {
        id: 21,
        name: "四川省",
        cities: {
            1: "成都市",
            2: "自贡市",
            3: "攀枝花市",
            4: "泸州市",
            5: "德阳市",
            6: "绵阳市",
            7: "广元市",
            8: "遂宁市",
            9: "内江市",
            10: "乐山市",
            11: "南充市",
            12: "眉山市",
            13: "宜宾市",
            14: "广安市",
            15: "达州市",
            16: "雅安市",
            17: "巴中市",
            18: "资阳市",
            19: "阿坝藏族羌族自治州",
            20: "甘孜藏族自治州",
            21: "凉山彝族自治州"
        }
    }, {
        id: 22,
        name: "贵州省",
        cities: {
            1: "贵阳市",
            2: "六盘水市",
            3: "遵义市",
            4: "安顺市",
            5: "铜仁地区",
            6: "黔西南布依族苗族自治州",
            7: "毕节地区",
            8: "黔东南苗族侗族自治州",
            9: "黔南布依族苗族自治州"
        }
    }, {
        id: 23,
        name: "云南省",
        cities: {
            1: "昆明市",
            2: "曲靖市",
            3: "玉溪市",
            4: "保山市",
            5: "昭通市",
            6: "丽江市",
            7: "普洱市",
            8: "临沧市",
            9: "楚雄彝族自治州",
            10: "红河哈尼族彝族自治州",
            12: "文山壮族苗族自治州",
            13: "西双版纳傣族自治州",
            14: "大理白族自治州",
            15: "德宏傣族景颇族自治州",
            16: "怒江傈僳族自治州",
            17: "迪庆藏族自治州"
        }
    }, {
        id: 24,
        name: "西藏",
        cities: {
            1: "拉萨市",
            2: "昌都地区",
            3: "山南地区",
            4: "日喀则地区",
            5: "那曲地区",
            6: "阿里地区",
            7: "林芝地区"
        }
    }, {
        id: 25,
        name: "陕西省",
        cities: {
            1: "西安市",
            2: "铜川市",
            3: "宝鸡市",
            4: "咸阳市",
            5: "渭南市",
            6: "延安市",
            7: "汉中市",
            8: "榆林市",
            9: "安康市",
            10: "商洛市"
        }
    }, {
        id: 26,
        name: "甘肃省",
        cities: {
            1: "兰州市",
            2: "嘉峪关市",
            3: "金昌市",
            4: "白银市",
            5: "天水市",
            6: "武威市",
            7: "张掖市",
            8: "平凉市",
            9: "酒泉市",
            10: "庆阳市",
            11: "定西市",
            12: "陇南市",
            13: "临夏回族自治州",
            14: "甘南藏族自治州"
        }
    }, {
        id: 27,
        name: "青海省",
        cities: {
            1: "西宁市",
            2: "海东地区",
            3: "海北藏族自治州",
            4: "黄南藏族自治州",
            5: "海南藏族自治州",
            6: "果洛藏族自治州",
            7: "玉树藏族自治州",
            8: "海西蒙古族藏族自治州"
        }
    }, {
        id: 28,
        name: "宁夏",
        cities: {
            1: "银川市",
            2: "石嘴山市",
            3: "吴忠市",
            4: "固原市",
            5: "中卫市"
        }
    }, {
        id: 29,
        name: "新疆",
        cities: {
            1: "乌鲁木齐市",
            2: "克拉玛依市",
            3: "吐鲁番地区",
            4: "哈密地区",
            5: "昌吉回族自治州",
            6: "博尔塔拉蒙古自治州",
            7: "巴音郭楞蒙古自治州",
            8: "阿克苏地区",
            9: "克孜勒苏柯尔克孜自治州",
            10: "喀什地区",
            11: "和田地区",
            12: "伊犁哈萨克自治州",
            13: "塔城地区",
            14: "阿勒泰地区",
            15: "石河子市",
            16: "阿拉尔市",
            17: "图木舒克市",
            18: "五家渠市"
        }
    }, {
        id: 30,
        name: "台湾省",
        cities: {
            1: "台北市",
            2: "高雄市",
            3: "基隆市",
            4: "台中市",
            5: "台南市",
            6: "新竹市",
            7: "嘉义市",
            8: "台北县",
            9: "宜兰县",
            10: "桃园县",
            11: "新竹县",
            12: "苗栗县",
            13: "台中县",
            14: "彰化县",
            15: "南投县",
            16: "云林县",
            17: "嘉义县",
            18: "台南县",
            19: "高雄县",
            20: "屏东县",
            21: "澎湖县",
            22: "台东县",
            23: "花莲县"
        }
    }, {
        id: 31,
        name: "海外",
        cities: {
            1: "阿尔及利亚",
            2: "阿根廷",
            3: "阿联酋",
            4: "埃及",
            5: "爱尔兰",
            6: "奥地利",
            7: "澳大利亚",
            8: "巴哈马",
            9: "巴基斯坦",
            10: "巴西",
            11: "白俄罗斯",
            12: "比利时",
            13: "冰岛",
            14: "波兰",
            15: "玻利维亚",
            16: "伯利兹",
            17: "朝鲜",
            18: "丹麦",
            19: "德国",
            20: "俄罗斯",
            21: "厄瓜多尔",
            22: "法国",
            23: "菲律宾",
            24: "芬兰",
            25: "哥伦比亚",
            26: "古巴",
            27: "关岛",
            28: "哈萨克斯坦",
            29: "韩国",
            30: "荷兰",
            31: "加拿大",
            32: "加纳",
            33: "柬埔寨",
            34: "捷克",
            35: "卡塔尔",
            36: "科威特",
            37: "克罗地亚",
            38: "肯尼亚",
            39: "老挝",
            40: "卢森堡",
            41: "罗马尼亚",
            42: "马尔代夫",
            43: "马来西亚",
            44: "美国",
            45: "蒙古",
            46: "孟加拉",
            47: "秘鲁",
            48: "缅甸",
            49: "摩洛哥",
            50: "墨西哥",
            51: "南非",
            52: "尼日利亚",
            53: "挪威",
            54: "葡萄牙",
            55: "日本",
            56: "瑞典",
            57: "瑞士",
            58: "沙特阿拉伯",
            59: "斯里兰卡",
            60: "苏丹",
            61: "泰国",
            62: "坦桑尼亚",
            63: "土耳其",
            64: "委内瑞拉",
            65: "乌克兰",
            66: "西班牙",
            67: "希腊",
            68: "新加坡",
            69: "新西兰",
            70: "匈牙利",
            71: "伊拉克",
            72: "伊朗",
            73: "以色列",
            74: "意大利",
            75: "印度",
            76: "印度尼西亚",
            77: "英国",
            78: "越南",
            79: "智利",
            80: "其他"
        }
    }]
    /**
     * 地区信息选择框
     * @type zong 地区
     * @type city 城市
     */
var zone = document.getElementById("zone");
var city = document.getElementById("city");
/**
 * 初始化地区信息
 * @param Z 地区
 * @param C 城市
 */
function INITArea(Z, C) {
    /**
     * 检查是否是在定义地区里面的
     * @type {Boolean}
     */
    var IsExZ = false;
    var index = 0;
    for (var i in Area) {
        if (Z == Area[i].name) {
            IsExZ = true;
            index = i;
            break;
        }
    }
    if (!IsExZ) {
        Z = "直辖市";
        C = "北京市";
    }
    /**
     * 检查是否在定义城市里
     * @type {Boolean}
     */
    var IsExC = false;
    for (var i in Area[index].cities) {
        if (C == Area[index].cities[i]) {
            IsExC = true;
            break;
        }
    }
    if (IsExZ && !IsExC) {
        C = Area[index].cities[1];
    }
    for (var i = 0; i < Area.length; i++) {
        zone.options.add(new Option(Area[i].name, Area[i].name));
    }
    zone.value = Z;
    for (var i in Area[zone.selectedIndex].cities) {
        city.options.add(new Option(Area[zone.selectedIndex].cities[i], Area[zone.selectedIndex].cities[i]));
    }
    city.value = C;
}
zone.onchange = function() {
    city.options.length = 0;
    for (var i in Area[zone.selectedIndex].cities) {
        city.options.add(new Option(Area[zone.selectedIndex].cities[i], Area[zone.selectedIndex].cities[i]));
    }
}